import RealtimeNavigation from "@/app/components/RealtimeNavigation";
import React from "react";

const page = () => {
  // const route =
  // [
  //נתיבות
  //   { lat: 31.283473943711826, lng: 34.80692328741589 },
  //   { lat: 31.253240274324877, lng: 34.76785391840664 },
  //   { lat: 31.322120716747207, lng: 34.633356568908404 },
  //   { lat: 31.357306341200307, lng: 34.63294494003394 },
  //   { lat: 31.42998601600043, lng: 34.56840026433961 },
  // ];

  // [
  //   //תל אביב
  //   { lat: 32.064873, lng: 34.792394 }, // קרוב ליגאל אלון
  //   { lat: 32.061245, lng: 34.789543 }, // סמוך לדרך השלום
  //   { lat: 32.065678, lng: 34.795123 }, // אזור מתחם שרונה
  //   { lat: 32.067234, lng: 34.790567 }, // ליד מגדלי עזריאלי
  //   { lat: 32.059876, lng: 34.79489 }, // ליד תחנת רכבת השלום
  // ];

  return <RealtimeNavigation />;
};

export default page;
